## python pandas data preparation

In [1]:
import numpy as np
import pandas as pd

In [2]:
ls

 Volume in drive C is Windows
 Volume Serial Number is F8E3-60DE

 Directory of c:\Users\saikiran\Desktop\py\uohyd

27-03-2021  08:20    <DIR>          .
27-03-2021  08:20    <DIR>          ..
27-03-2021  08:09    <DIR>          .ipynb_checkpoints
24-03-2021  16:16               226 Data.csv
27-03-2021  08:09           116,779 data_processing.ipynb
24-03-2021  17:33             8,038 emp_processed.csv
27-03-2021  08:20           140,167 pandas_ex.ipynb
24-03-2021  17:33           869,537 Train_UWu5bXk.csv
               5 File(s)      1,134,747 bytes
               3 Dir(s)  265,084,620,800 bytes free

In [3]:
pwd

'c:\\Users\\saikiran\\Desktop\\py\\uohyd'

In [4]:
df = pd.read_csv("Data.csv")

In [5]:
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
df.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 448.0+ bytes

In [8]:
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [9]:
df.tail()

   Country   Age   Salary Purchased
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [10]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [11]:
df.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [12]:
df.dtypes

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

In [13]:
len(df)

10

In [14]:
df['Country']

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [15]:
df.Country

0     France
1      Spain
2    Germany
3      Spain
4    Germany
5     France
6      Spain
7     France
8    Germany
9     France
Name: Country, dtype: object

In [16]:
df[["Country","Salary"]]

   Country   Salary
0   France  72000.0
1    Spain  48000.0
2  Germany  54000.0
3    Spain  61000.0
4  Germany      NaN
5   France  58000.0
6    Spain  52000.0
7   France  79000.0
8  Germany  83000.0
9   France  67000.0

In [17]:
df["serial No"] = np.array(range(1,11), dtype='str')
df

   Country   Age   Salary Purchased serial No
0   France  44.0  72000.0        No         1
1    Spain  27.0  48000.0       Yes         2
2  Germany  30.0  54000.0        No         3
3    Spain  38.0  61000.0        No         4
4  Germany  40.0      NaN       Yes         5
5   France  35.0  58000.0       Yes         6
6    Spain   NaN  52000.0        No         7
7   France  48.0  79000.0       Yes         8
8  Germany  50.0  83000.0        No         9
9   France  37.0  67000.0       Yes        10

In [18]:
df = df.set_index('serial No')
df

           Country   Age   Salary Purchased
serial No
1           France  44.0  72000.0        No
2            Spain  27.0  48000.0       Yes
3          Germany  30.0  54000.0        No
4            Spain  38.0  61000.0        No
5          Germany  40.0      NaN       Yes
6           France  35.0  58000.0       Yes
7            Spain   NaN  52000.0        No
8           France  48.0  79000.0       Yes
9          Germany  50.0  83000.0        No
10          France  37.0  67000.0       Yes

In [19]:
#name in loc
df.loc['8']

Country      France
Age              48
Salary        79000
Purchased       Yes
Name: 8, dtype: object

In [20]:
#index in iloc
df.iloc[1]

Country      Spain
Age             27
Salary       48000
Purchased      Yes
Name: 2, dtype: object

In [21]:
df.iloc[1][0]

'Spain'

In [22]:
df = df.reset_index('serial No')
df

  serial No  Country   Age   Salary Purchased
0         1   France  44.0  72000.0        No
1         2    Spain  27.0  48000.0       Yes
2         3  Germany  30.0  54000.0        No
3         4    Spain  38.0  61000.0        No
4         5  Germany  40.0      NaN       Yes
5         6   France  35.0  58000.0       Yes
6         7    Spain   NaN  52000.0        No
7         8   France  48.0  79000.0       Yes
8         9  Germany  50.0  83000.0        No
9        10   France  37.0  67000.0       Yes

In [23]:
df = df.drop('serial No', axis=1)
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [24]:
one_row = {'Country':'India', 'Age':25, 'Salary':25000, 'Purchased':'Yes'}
one_row

{'Country': 'India', 'Age': 25, 'Salary': 25000, 'Purchased': 'Yes'}

In [25]:
df = df.append(one_row,ignore_index=True)
df

    Country   Age   Salary Purchased
0    France  44.0  72000.0        No
1     Spain  27.0  48000.0       Yes
2   Germany  30.0  54000.0        No
3     Spain  38.0  61000.0        No
4   Germany  40.0      NaN       Yes
5    France  35.0  58000.0       Yes
6     Spain   NaN  52000.0        No
7    France  48.0  79000.0       Yes
8   Germany  50.0  83000.0        No
9    France  37.0  67000.0       Yes
10    India  25.0  25000.0       Yes

In [26]:
df.iloc[10]

Country      India
Age             25
Salary       25000
Purchased      Yes
Name: 10, dtype: object

In [27]:
df = df.drop(10)
df

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [28]:
df[df['Country'] == 'France']

  Country   Age   Salary Purchased
0  France  44.0  72000.0        No
5  France  35.0  58000.0       Yes
7  France  48.0  79000.0       Yes
9  France  37.0  67000.0       Yes

In [29]:
df[(df['Country'] == 'Germany') | (df['Country'] == 'Spain')]

   Country   Age   Salary Purchased
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
6    Spain   NaN  52000.0        No
8  Germany  50.0  83000.0        No

In [30]:
df[(df['Country'] == 'Germany') & (df['Purchased'] == 'No')]

   Country   Age   Salary Purchased
2  Germany  30.0  54000.0        No
8  Germany  50.0  83000.0        No

In [31]:
def rever(x):
    return x[::-1]

In [32]:
rever('kiran')

'narik'

In [33]:
df['Country'].apply(rever)

0     ecnarF
1      niapS
2    ynamreG
3      niapS
4    ynamreG
5     ecnarF
6      niapS
7     ecnarF
8    ynamreG
9     ecnarF
Name: Country, dtype: object

In [34]:
df.Age.dtypes

dtype('float64')

In [35]:
df.Country.unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [36]:
df.Age.unique()

array([44., 27., 30., 38., 40., 35., nan, 48., 50., 37.])

In [37]:
df.Purchased.unique()

array(['No', 'Yes'], dtype=object)

In [38]:
df.Country.value_counts()

France     4
Spain      3
Germany    3
Name: Country, dtype: int64

In [39]:
df.Country.value_counts(normalize=True)

France     0.4
Spain      0.3
Germany    0.3
Name: Country, dtype: float64

In [40]:
df.Purchased.value_counts()

Yes    5
No     5
Name: Purchased, dtype: int64

In [41]:
df.Purchased.value_counts(normalize=True)

Yes    0.5
No     0.5
Name: Purchased, dtype: float64

In [42]:
df.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [43]:
df.isnull().any().any()

True

In [44]:
df.isnull().values.any()

True

In [45]:
df.isnull().values.sum()

2

In [46]:
df.isnull().any()

Country      False
Age           True
Salary        True
Purchased    False
dtype: bool

In [47]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [48]:
df[df.isnull().any(axis=1)]

   Country   Age   Salary Purchased
4  Germany  40.0      NaN       Yes
6    Spain   NaN  52000.0        No

In [49]:
df.Age.mean()

38.77777777777778

In [50]:
df.Salary.mean()

63777.77777777778

In [51]:
dataset = df

In [52]:
dataset = dataset.fillna({"Age":38, "Salary":63777})

In [53]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0  63777.0       Yes
5   France  35.0  58000.0       Yes
6    Spain  38.0  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [54]:
def age_gr(x):
    if x<=40:
        return '30S'
    elif  x > 40 and x <=50 :
        return '50s'

In [55]:
age_gr(50.0)

'50s'

In [56]:
dataset['Age'].apply(age_gr)

0    50s
1    30S
2    30S
3    30S
4    30S
5    30S
6    30S
7    50s
8    50s
9    30S
Name: Age, dtype: object

In [57]:
x = lambda a, b : a * b
print(x(5, 6))

30

In [58]:
dataset['Salary'].apply(lambda x:x/12)

0    6000.000000
1    4000.000000
2    4500.000000
3    5083.333333
4    5314.750000
5    4833.333333
6    4333.333333
7    6583.333333
8    6916.666667
9    5583.333333
Name: Salary, dtype: float64

In [59]:
def quality(Age,Sal):
    if Sal/Age  > 1500:
        return "Generous"
    else:
        return "Other"

In [60]:
dataset[['Salary', 'Age']].apply(lambda dataset: quality(dataset['Age'],dataset['Salary']),axis=1)

0    Generous
1    Generous
2    Generous
3    Generous
4    Generous
5    Generous
6       Other
7    Generous
8    Generous
9    Generous
dtype: object

In [61]:
dataset[['Salary', 'Age']].apply(lambda dataset: quality(dataset['Age'],dataset['Salary']),axis=1)

0    Generous
1    Generous
2    Generous
3    Generous
4    Generous
5    Generous
6       Other
7    Generous
8    Generous
9    Generous
dtype: object

In [62]:
dataset['quality'] = np.vectorize(quality)(dataset['Age'], dataset['Salary'])
dataset

   Country   Age   Salary Purchased   quality
0   France  44.0  72000.0        No  Generous
1    Spain  27.0  48000.0       Yes  Generous
2  Germany  30.0  54000.0        No  Generous
3    Spain  38.0  61000.0        No  Generous
4  Germany  40.0  63777.0       Yes  Generous
5   France  35.0  58000.0       Yes  Generous
6    Spain  38.0  52000.0        No     Other
7   France  48.0  79000.0       Yes  Generous
8  Germany  50.0  83000.0        No  Generous
9   France  37.0  67000.0       Yes  Generous

In [63]:
dataset = pd.get_dummies(df, columns=["Country"])
dataset

    Age   Salary Purchased  Country_France  Country_Germany  Country_Spain
0  44.0  72000.0        No               1                0              0
1  27.0  48000.0       Yes               0                0              1
2  30.0  54000.0        No               0                1              0
3  38.0  61000.0        No               0                0              1
4  40.0      NaN       Yes               0                1              0
5  35.0  58000.0       Yes               1                0              0
6   NaN  52000.0        No               0                0              1
7  48.0  79000.0       Yes               1                0              0
8  50.0  83000.0        No               0                1              0
9  37.0  67000.0       Yes               1                0              0

In [64]:
dataset.describe()

             Age        Salary  Country_France  Country_Germany  Country_Spain
count   9.000000      9.000000       10.000000        10.000000      10.000000
mean   38.777778  63777.777778        0.400000         0.300000       0.300000
std     7.693793  12265.579662        0.516398         0.483046       0.483046
min    27.000000  48000.000000        0.000000         0.000000       0.000000
25%    35.000000  54000.000000        0.000000         0.000000       0.000000
50%    38.000000  61000.000000        0.000000         0.000000       0.000000
75%    44.000000  72000.000000        1.000000         0.750000       0.750000
max    50.000000  83000.000000        1.000000         1.000000       1.000000

In [65]:
pd.get_dummies(df, columns=["Country", "Purchased"])

,Age,Salary,Country_France,Country_Germany,Country_Spain,Purchased_No,Purchased_Yes
0,44.0,72000.0,1,0,0,1,0
1,27.0,48000.0,0,0,1,0,1
2,30.0,54000.0,0,1,0,1,0
3,38.0,61000.0,0,0,1,1,0
4,40.0,NaN,0,1,0,0,1
5,35.0,58000.0,1,0,0,0,1
6,NaN,52000.0,0,0,1,1,0
7,48.0,79000.0,1,0,0,0,1
8,50.0,83000.0,0,1,0,1,0
9,37.0,67000.0,1,0,0,0,1

In [66]:
assign_label = {"Purchased":{"Yes": 1, "No": 0}}

In [67]:
dataset

    Age   Salary Purchased  Country_France  Country_Germany  Country_Spain
0  44.0  72000.0        No               1                0              0
1  27.0  48000.0       Yes               0                0              1
2  30.0  54000.0        No               0                1              0
3  38.0  61000.0        No               0                0              1
4  40.0      NaN       Yes               0                1              0
5  35.0  58000.0       Yes               1                0              0
6   NaN  52000.0        No               0                0              1
7  48.0  79000.0       Yes               1                0              0
8  50.0  83000.0        No               0                1              0
9  37.0  67000.0       Yes               1                0              0

In [68]:
df.replace(assign_label, inplace=True)

In [69]:
df

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1    Spain  27.0  48000.0          1
2  Germany  30.0  54000.0          0
3    Spain  38.0  61000.0          0
4  Germany  40.0      NaN          1
5   France  35.0  58000.0          1
6    Spain   NaN  52000.0          0
7   France  48.0  79000.0          1
8  Germany  50.0  83000.0          0
9   France  37.0  67000.0          1

In [70]:
dataset

    Age   Salary Purchased  Country_France  Country_Germany  Country_Spain
0  44.0  72000.0        No               1                0              0
1  27.0  48000.0       Yes               0                0              1
2  30.0  54000.0        No               0                1              0
3  38.0  61000.0        No               0                0              1
4  40.0      NaN       Yes               0                1              0
5  35.0  58000.0       Yes               1                0              0
6   NaN  52000.0        No               0                0              1
7  48.0  79000.0       Yes               1                0              0
8  50.0  83000.0        No               0                1              0
9  37.0  67000.0       Yes               1                0              0

In [71]:
df

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1    Spain  27.0  48000.0          1
2  Germany  30.0  54000.0          0
3    Spain  38.0  61000.0          0
4  Germany  40.0      NaN          1
5   France  35.0  58000.0          1
6    Spain   NaN  52000.0          0
7   France  48.0  79000.0          1
8  Germany  50.0  83000.0          0
9   France  37.0  67000.0          1

In [72]:
df['age_group'] = pd.cut(x=df['Age'], bins=[20, 29, 39, 49, 59], labels=['20s', '30s', '40s', '50s'])
df

   Country   Age   Salary  Purchased age_group
0   France  44.0  72000.0          0       40s
1    Spain  27.0  48000.0          1       20s
2  Germany  30.0  54000.0          0       30s
3    Spain  38.0  61000.0          0       30s
4  Germany  40.0      NaN          1       40s
5   France  35.0  58000.0          1       30s
6    Spain   NaN  52000.0          0       NaN
7   France  48.0  79000.0          1       40s
8  Germany  50.0  83000.0          0       50s
9   France  37.0  67000.0          1       30s

In [73]:
Q1 = df.quantile(0.25)
Q1

Age             35.0
Salary       54000.0
Purchased        0.0
Name: 0.25, dtype: float64

In [74]:
Q2 = df.quantile(0.5)
Q2

Age             38.0
Salary       61000.0
Purchased        0.5
Name: 0.5, dtype: float64

In [75]:
Q3 = df.quantile(0.5)
Q3

Age             38.0
Salary       61000.0
Purchased        0.5
Name: 0.5, dtype: float64

In [76]:
df['Country'].value_counts()

France     4
Spain      3
Germany    3
Name: Country, dtype: int64

In [77]:
df

   Country   Age   Salary  Purchased age_group
0   France  44.0  72000.0          0       40s
1    Spain  27.0  48000.0          1       20s
2  Germany  30.0  54000.0          0       30s
3    Spain  38.0  61000.0          0       30s
4  Germany  40.0      NaN          1       40s
5   France  35.0  58000.0          1       30s
6    Spain   NaN  52000.0          0       NaN
7   France  48.0  79000.0          1       40s
8  Germany  50.0  83000.0          0       50s
9   France  37.0  67000.0          1       30s

In [78]:
df.groupby(['Country','Purchased']).mean()

                    Age   Salary
Country Purchased
France  0          44.0  72000.0
        1          40.0  68000.0
Germany 0          40.0  68500.0
        1          40.0      NaN
Spain   0          38.0  56500.0
        1          27.0  48000.0

In [79]:
df[df["Age"] >=45]

   Country   Age   Salary  Purchased age_group
7   France  48.0  79000.0          1       40s
8  Germany  50.0  83000.0          0       50s

In [80]:
pd.crosstab(df.Country,df.Purchased,margins=True)

Purchased  0  1  All
Country
France     1  3    4
Germany    2  1    3
Spain      2  1    3
All        5  5   10

In [81]:
df[(df["Country"] == 'France') | (df["Country"] == 'Spain')]

  Country   Age   Salary  Purchased age_group
0  France  44.0  72000.0          0       40s
1   Spain  27.0  48000.0          1       20s
3   Spain  38.0  61000.0          0       30s
5  France  35.0  58000.0          1       30s
6   Spain   NaN  52000.0          0       NaN
7  France  48.0  79000.0          1       40s
9  France  37.0  67000.0          1       30s

##Another dataset

In [82]:
df = pd.read_csv("emp_processed.csv")
df

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,MANAGER_ID,DEPARTMENT_ID
0,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1989-09-21,AD_VP,17000,100,90.0
1,102,Lex,De Haan,LDEHAAN,515.123.4569,1993-01-13,AD_VP,17000,100,90.0
2,103,Alexander,Hunold,AHUNOLD,590.423.4567,1990-01-03,IT_PROG,9000,102,60.0
3,104,Bruce,Ernst,BERNST,590.423.4568,1991-05-21,IT_PROG,6000,103,60.0
4,105,David,Austin,DAUSTIN,590.423.4569,1997-06-25,IT_PROG,4800,103,60.0
...,...,...,...,...,...,...,...,...,...,...
101,202,Pat,Fay,PFAY,603.123.6666,1997-08-17,MK_REP,6000,201,20.0
102,203,Susan,Mavris,SMAVRIS,515.123.7777,1994-06-07,HR_REP,6500,101,40.0
103,204,Hermann,Baer,HBAER,515.123.8888,1994-06-07,PR_REP,10000,101,70.0
104,205,Shelley,Higgins,SHIGGINS,515.123.8080,1994-06-07,AC_MGR,12000,101,110.0
105,206,William,Gietz,WGIETZ,515.123.8181,1994-06-07,AC_ACCOUNT,8300,205,110.0

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 106 entries, 0 to 105
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EMPLOYEE_ID    106 non-null    int64
 1   FIRST_NAME     106 non-null    object
 2   LAST_NAME      106 non-null    object
 3   EMAIL          106 non-null    object
 4   PHONE_NUMBER   106 non-null    object
 5   HIRE_DATE      106 non-null    object
 6   JOB_ID         106 non-null    object
 7   SALARY         106 non-null    int64
 8   MANAGER_ID     106 non-null    int64
 9   DEPARTMENT_ID  105 non-null    float64
dtypes: float64(1), int64(3), object(6)
memory usage: 8.4+ KB

In [84]:
df.EMPLOYEE_ID.value_counts()

206    1
127    1
129    1
130    1
131    1
      ..
174    1
175    1
176    1
177    1
101    1
Name: EMPLOYEE_ID, Length: 106, dtype: int64

In [85]:
np.count_nonzero(df.EMPLOYEE_ID.unique())

106

In [86]:
df.MANAGER_ID.count()

106

In [87]:
df.MANAGER_ID.value_counts()

100    14
124     8
122     8
121     8
120     8
123     8
146     6
147     6
148     6
149     6
145     6
108     5
114     5
101     5
103     4
205     1
201     1
102     1
Name: MANAGER_ID, dtype: int64

In [88]:
df.groupby(['MANAGER_ID','EMPLOYEE_ID']).sum()

                        SALARY  DEPARTMENT_ID
MANAGER_ID EMPLOYEE_ID
100        101           17000           90.0
           102           17000           90.0
           114           11000           30.0
           120            8000           50.0
           121            8200           50.0
...                        ...            ...
149        177            8400           80.0
           178            7000            0.0
           179            6200           80.0
201        202            6000           20.0
205        206            8300          110.0

[106 rows x 2 columns]

In [89]:

before = type(df.EMPLOYEE_ID[0])
  

df.EMPLOYEE_ID = df.EMPLOYEE_ID.astype('string')
  

after = type(df.EMPLOYEE_ID[0])

In [90]:
before

numpy.int64

In [91]:
after

str

In [92]:
df.groupby('MANAGER_ID').EMPLOYEE_ID.count()

MANAGER_ID
100    14
101     5
102     1
103     4
108     5
114     5
120     8
121     8
122     8
123     8
124     8
145     6
146     6
147     6
148     6
149     6
201     1
205     1
Name: EMPLOYEE_ID, dtype: int64

In [93]:
np.array(df.groupby('MANAGER_ID').EMPLOYEE_ID.count()).sum()

106

In [94]:
import numpy as np

In [95]:
df.groupby('MANAGER_ID').sum()

            SALARY  DEPARTMENT_ID
MANAGER_ID
100         155400          880.0
101          44900          330.0
102           9000           60.0
103          19800          240.0
108          39600          500.0
114          13900          150.0
120          22100          400.0
121          25400          400.0
122          23600          400.0
123          25900          400.0
124          23000          400.0
145          51000          480.0
146          51000          480.0
147          46600          480.0
148          51900          480.0
149          50000          400.0
201           6000           20.0
205           8300          110.0

In [96]:
df.groupby(['EMPLOYEE_ID', 'MANAGER_ID']).EMPLOYEE_ID.count()

EMPLOYEE_ID  MANAGER_ID
101          100           1
102          100           1
103          102           1
104          103           1
105          103           1
                          ..
202          201           1
203          101           1
204          101           1
205          101           1
206          205           1
Name: EMPLOYEE_ID, Length: 106, dtype: int64

In [97]:
df.isna().any()

EMPLOYEE_ID      False
FIRST_NAME       False
LAST_NAME        False
EMAIL            False
PHONE_NUMBER     False
HIRE_DATE        False
JOB_ID           False
SALARY           False
MANAGER_ID       False
DEPARTMENT_ID     True
dtype: bool

In [98]:
df.groupby(['DEPARTMENT_ID','EMPLOYEE_ID']).EMPLOYEE_ID.count()

DEPARTMENT_ID  EMPLOYEE_ID
10.0           200            1
20.0           201            1
               202            1
30.0           114            1
               115            1
                             ..
100.0          111            1
               112            1
               113            1
110.0          205            1
               206            1
Name: EMPLOYEE_ID, Length: 105, dtype: int64

In [99]:
df[df.isnull().any(axis=1)]

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,MANAGER_ID,DEPARTMENT_ID
77,178,Kimberely,Grant,KGRANT,011.44.1644.429263,1999-05-24,SA_REP,7000,149,NaN

# #Another data set

In [100]:
import numpy as np
import pandas as pd

In [101]:
df = pd.read_csv('Train_UWu5bXk.csv')
df

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.300,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.920,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.500,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.200,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.930,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052
...,...,...,...,...,...,...,...,...,...,...,...,...
8518,FDF22,6.865,Low Fat,0.056783,Snack Foods,214.5218,OUT013,1987,High,Tier 3,Supermarket Type1,2778.3834
8519,FDS36,8.380,Regular,0.046982,Baking Goods,108.1570,OUT045,2002,NaN,Tier 2,Supermarket Type1,549.2850
8520,NCJ29,10.600,Low Fat,0.035186,Health and Hygiene,85.1224,OUT035,2004,Small,Tier 2,Supermarket Type1,1193.1136
8521,FDN46,7.210,Regular,0.145221,Snack Foods,103.1332,OUT018,2009,Medium,Tier 3,Supermarket Type2,1845.5976
8522,DRG01,14.800,Low Fat,0.044878,Soft Drinks,75.4670,OUT046,1997,Small,Tier 1,Supermarket Type1,765.6700

In [102]:
df.Item_Fat_Content	.unique()

array(['Low Fat', 'Regular', 'low fat', 'LF', 'reg'], dtype=object)

In [103]:
assign_lebels = {'Low Fat':'LF', 'low fat':'LF', 'reg':'REG', 'Regular':'REG'}

In [104]:
df = df.replace(assign_lebels)
df

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.300,LF,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.920,REG,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.500,LF,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.200,REG,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.930,LF,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052
...,...,...,...,...,...,...,...,...,...,...,...,...
8518,FDF22,6.865,LF,0.056783,Snack Foods,214.5218,OUT013,1987,High,Tier 3,Supermarket Type1,2778.3834
8519,FDS36,8.380,REG,0.046982,Baking Goods,108.1570,OUT045,2002,NaN,Tier 2,Supermarket Type1,549.2850
8520,NCJ29,10.600,LF,0.035186,Health and Hygiene,85.1224,OUT035,2004,Small,Tier 2,Supermarket Type1,1193.1136
8521,FDN46,7.210,REG,0.145221,Snack Foods,103.1332,OUT018,2009,Medium,Tier 3,Supermarket Type2,1845.5976
8522,DRG01,14.800,LF,0.044878,Soft Drinks,75.4670,OUT046,1997,Small,Tier 1,Supermarket Type1,765.6700

In [105]:
df['Outlet_Size'].isnull().sum()

2410

In [106]:
df['Outlet_Size'] = np.where((df.Outlet_Type.values == 'Grocery Store'), 'Small', df.Outlet_Size.values)
df

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.300,LF,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.920,REG,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.500,LF,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.200,REG,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,Small,Tier 3,Grocery Store,732.3800
4,NCD19,8.930,LF,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052
...,...,...,...,...,...,...,...,...,...,...,...,...
8518,FDF22,6.865,LF,0.056783,Snack Foods,214.5218,OUT013,1987,High,Tier 3,Supermarket Type1,2778.3834
8519,FDS36,8.380,REG,0.046982,Baking Goods,108.1570,OUT045,2002,NaN,Tier 2,Supermarket Type1,549.2850
8520,NCJ29,10.600,LF,0.035186,Health and Hygiene,85.1224,OUT035,2004,Small,Tier 2,Supermarket Type1,1193.1136
8521,FDN46,7.210,REG,0.145221,Snack Foods,103.1332,OUT018,2009,Medium,Tier 3,Supermarket Type2,1845.5976
8522,DRG01,14.800,LF,0.044878,Soft Drinks,75.4670,OUT046,1997,Small,Tier 1,Supermarket Type1,765.6700

In [107]:
df['Outlet_Size'].isnull().sum()

1855

In [108]:
df['Outlet_Size'] = np.where(
    (df.Outlet_Type.values == 'Supermarket Type1') & (df.Outlet_Location_Type.values == 'Tier 2'), 'Small',
    df.Outlet_Size.values)

In [109]:
df['Outlet_Size'].isnull().sum()

0

In [110]:
df['Outlet_Size'].mode()

0    Small
dtype: object

In [111]:
df[df['Item_Weight'].isna()]

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
7,FDP10,NaN,LF,0.127470,Snack Foods,107.7622,OUT027,1985,Medium,Tier 3,Supermarket Type3,4022.7636
18,DRI11,NaN,LF,0.034238,Hard Drinks,113.2834,OUT027,1985,Medium,Tier 3,Supermarket Type3,2303.6680
21,FDW12,NaN,REG,0.035400,Baking Goods,144.5444,OUT027,1985,Medium,Tier 3,Supermarket Type3,4064.0432
23,FDC37,NaN,LF,0.057557,Baking Goods,107.6938,OUT019,1985,Small,Tier 1,Grocery Store,214.3876
29,FDC14,NaN,REG,0.072222,Canned,43.6454,OUT019,1985,Small,Tier 1,Grocery Store,125.8362
...,...,...,...,...,...,...,...,...,...,...,...,...
8485,DRK37,NaN,LF,0.043792,Soft Drinks,189.0530,OUT027,1985,Medium,Tier 3,Supermarket Type3,6261.8490
8487,DRG13,NaN,LF,0.037006,Soft Drinks,164.7526,OUT027,1985,Medium,Tier 3,Supermarket Type3,4111.3150
8488,NCN14,NaN,LF,0.091473,Others,184.6608,OUT027,1985,Medium,Tier 3,Supermarket Type3,2756.4120
8490,FDU44,NaN,REG,0.102296,Fruits and Vegetables,162.3552,OUT019,1985,Small,Tier 1,Grocery Store,487.3656
8504,NCN18,NaN,LF,0.124111,Household,111.7544,OUT027,1985,Medium,Tier 3,Supermarket Type3,4138.6128

In [112]:
df['Item_Weight'].isnull().sum()

1463

In [113]:
len(df['Item_Identifier'].unique())

1559

In [114]:
df['Item_Identifier'].unique()

array(['FDA15', 'DRC01', 'FDN15', ..., 'NCF55', 'NCW30', 'NCW05'],
      dtype=object)

In [115]:
df

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.300,LF,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.920,REG,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.500,LF,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.200,REG,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,Small,Tier 3,Grocery Store,732.3800
4,NCD19,8.930,LF,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052
...,...,...,...,...,...,...,...,...,...,...,...,...
8518,FDF22,6.865,LF,0.056783,Snack Foods,214.5218,OUT013,1987,High,Tier 3,Supermarket Type1,2778.3834
8519,FDS36,8.380,REG,0.046982,Baking Goods,108.1570,OUT045,2002,Small,Tier 2,Supermarket Type1,549.2850
8520,NCJ29,10.600,LF,0.035186,Health and Hygiene,85.1224,OUT035,2004,Small,Tier 2,Supermarket Type1,1193.1136
8521,FDN46,7.210,REG,0.145221,Snack Foods,103.1332,OUT018,2009,Medium,Tier 3,Supermarket Type2,1845.5976
8522,DRG01,14.800,LF,0.044878,Soft Drinks,75.4670,OUT046,1997,Small,Tier 1,Supermarket Type1,765.6700

In [116]:
dummy = df[['Item_Identifier', 'Item_Weight']]
dummy

     Item_Identifier  Item_Weight
0              FDA15        9.300
1              DRC01        5.920
2              FDN15       17.500
3              FDX07       19.200
4              NCD19        8.930
...              ...          ...
8518           FDF22        6.865
8519           FDS36        8.380
8520           NCJ29       10.600
8521           FDN46        7.210
8522           DRG01       14.800

[8523 rows x 2 columns]

In [117]:
dummy[dummy['Item_Weight'].isna()]

     Item_Identifier  Item_Weight
7              FDP10          NaN
18             DRI11          NaN
21             FDW12          NaN
23             FDC37          NaN
29             FDC14          NaN
...              ...          ...
8485           DRK37          NaN
8487           DRG13          NaN
8488           NCN14          NaN
8490           FDU44          NaN
8504           NCN18          NaN

[1463 rows x 2 columns]

In [118]:
dummy = dummy[(dummy.Item_Weight.isnull() == False)]
dummy

     Item_Identifier  Item_Weight
0              FDA15        9.300
1              DRC01        5.920
2              FDN15       17.500
3              FDX07       19.200
4              NCD19        8.930
...              ...          ...
8518           FDF22        6.865
8519           FDS36        8.380
8520           NCJ29       10.600
8521           FDN46        7.210
8522           DRG01       14.800

[7060 rows x 2 columns]

In [119]:
len(dummy.Item_Identifier.unique())

1555

In [120]:
dummy = dummy.drop_duplicates()
dummy

     Item_Identifier  Item_Weight
0              FDA15        9.300
1              DRC01        5.920
2              FDN15       17.500
3              FDX07       19.200
4              NCD19        8.930
...              ...          ...
7298           NCW05       20.250
7373           FDS09        8.895
7421           FDU43       19.350
7944           FDO49       10.600
8471           NCT53        5.400

[1555 rows x 2 columns]

In [121]:
dummy = dummy.transpose()
dummy

,0,1,2,3,4,5,6,8,9,10,...,6369,6440,6563,6892,7039,7298,7373,7421,7944,8471
Item_Identifier,FDA15,DRC01,FDN15,FDX07,NCD19,FDP36,FDO10,FDH17,FDU28,FDY07,...,FDO08,FDD28,FDG04,NCF55,NCW30,NCW05,FDS09,FDU43,FDO49,NCT53
Item_Weight,9.3,5.92,17.5,19.2,8.93,10.395,13.65,16.2,19.2,11.8,...,11.1,10.695,13.1,6.675,5.21,20.25,8.895,19.35,10.6,5.4

In [122]:
new_header = dummy.iloc[0] #grab the first row for the header
new_header

0       FDA15
1       DRC01
2       FDN15
3       FDX07
4       NCD19
        ...
7298    NCW05
7373    FDS09
7421    FDU43
7944    FDO49
8471    NCT53
Name: Item_Identifier, Length: 1555, dtype: object

In [123]:
dummy = dummy[1:] #take the data less the header row
dummy

,0,1,2,3,4,5,6,8,9,10,...,6369,6440,6563,6892,7039,7298,7373,7421,7944,8471
Item_Weight,9.3,5.92,17.5,19.2,8.93,10.395,13.65,16.2,19.2,11.8,...,11.1,10.695,13.1,6.675,5.21,20.25,8.895,19.35,10.6,5.4

In [124]:
dummy.columns = new_header #set the header row as the df header
dummy

Item_Identifier,FDA15,DRC01,FDN15,FDX07,NCD19,FDP36,FDO10,FDH17,FDU28,FDY07,...,FDO08,FDD28,FDG04,NCF55,NCW30,NCW05,FDS09,FDU43,FDO49,NCT53
Item_Weight,9.3,5.92,17.5,19.2,8.93,10.395,13.65,16.2,19.2,11.8,...,11.1,10.695,13.1,6.675,5.21,20.25,8.895,19.35,10.6,5.4

In [125]:
d = dummy.to_dict()
d

': {'Item_Weight': 9.6},
 'FDD16': {'Item_Weight': 20.5},
 'FDY44': {'Item_Weight': 14.15},
 'DRH51': {'Item_Weight': 17.6},
 'FDI50': {'Item_Weight': 8.42},
 'FDB60': {'Item_Weight': 9.3},
 'FDA20': {'Item_Weight': 6.78},
 'DRF37': {'Item_Weight': 17.25},
 'FDJ26': {'Item_Weight': 15.3},
 'FDZ25': {'Item_Weight': 15.7},
 'FDZ58': {'Item_Weight': 17.85},
 'NCG18': {'Item_Weight': 15.3},
 'FDH50': {'Item_Weight': 15.0},
 'DRO35': {'Item_Weight': 13.85},
 'FDP52': {'Item_Weight': 18.7},
 'FDC05': {'Item_Weight': 13.1},
 'NCA41': {'Item_Weight': 16.75},
 'FDX56': {'Item_Weight': 17.1},
 'NCP02': {'Item_Weight': 7.105},
 'FDZ49': {'Item_Weight': 11.0},
 'NCJ17': {'Item_Weight': 7.68},
 'FDP48': {'Item_Weight': 7.52},
 'FDI53': {'Item_Weight': 8.895},
 'FDW02': {'Item_Weight': 4.805},
 'FDO48': {'Item_Weight': 15.0},
 'NCR53': {'Item_Weight': 12.15},
 'FDF56': {'Item_Weight': 16.7},
 'FDL57': {'Item_Weight': 15.1},
 'FDV52': {'Item_Weight': 20.7},
 'NCS41': {'Item_Weight': 12.85},
 'FDF12': {'Item_Weight': 8.235},
 'FDM13': {'Item_Weight': 6.425},
 'NCS42': {'Item_Weight': 8.6},
 'FDD47': {'Item_Weight': 7.6},
 'DRE03': {'Item_Weight': 19.6},
 'FDE20': {'Item_Weight': 11.35},
 'FDI33': {'Item_Weight': 16.5},
 'NCT06': {'Item_Weight': 17.1},
 'FDD10': {'Item_Weight': 20.6},
 'FDK52': {'Item_Weight': 18.25},
 'FDJ36': {'Item_Weight': 14.5},
 'NCK18': {'Item_Weight': 9.6},
 'FDB08': {'Item_Weight': 6.055},
 'FDX43': {'Item_Weight': 5.655},
 'FDU58': {'Item_Weight': 6.61},
 'NCT29': {'Item_Weight': 12.6},
 'NCB43': {'Item_Weight': 20.2},
 'FDR37': {'Item_Weight': 16.5},
 'FDG56': {'Item_Weight': 13.3},
 'FDL13': {'Item_Weight': 13.85},
 'FDQ03': {'Item_Weight': 15.0},
 'NCC55': {'Item_Weight': 10.695},
 'FDA25': {'Item_Weight': 16.5},
 'FDV33': {'Item_Weight': 9.6},
 'FDX47': {'Item_Weight': 6.55},
 'FDB02': {'Item_Weight': 9.695},
 'FDI56': {'Item_Weight': 7.325},
 'FDQ08': {'Item_Weight': 15.7},
 'DRJ49': {'Item_Weight': 6.865},
 'FDP26': {'Item_Weight': 7.785},
 'FDO32': {'Item_Weight': 6.36},
 'FDR34': {'Item_Weight': 17.0},
 'FDU59': {'Item_Weight': 5.78},
 'FDN31': {'Item_Weight': 11.5},
 'FDC03': {'Item_Weight': 8.575},
 'FDL14': {'Item_Weight': 8.115},
 'FDP39': {'Item_Weight': 12.65},
 'FDT11': {'Item_Weight': 5.94},
 'FDU48': {'Item_Weight': 18.85},
 'NCP06': {'Item_Weight': 20.7},
 'FDT45': {'Item_Weight': 15.85},
 'FDE56': {'Item_Weight': 17.25},
 'FDZ34': {'Item_Weight': 6.695},
 'NCM54': {'Item_Weight': 17.7},
 'FDV24': {'Item_Weight': 5.635},
 'FDD46': {'Item_Weight': 6.035},
 'FDQ39': {'Item_Weight': 14.8},
 'FDE11': {'Item_Weight': 17.7},
 'NCU54': {'Item_Weight': 8.88},
 'FDO60': {'Item_Weight': 20.0},
 'NCS06': {'Item_Weight': 7.935},
 'FDQ55': {'Item_Weight': 13.65},
 'NCO02': {'Item_Weight': 11.15},
 'FDB12': {'Item_Weight': 11.15},
 'FDT40': {'Item_Weight': 5.985},
 'NCO05': {'Item_Weight': 7.27},
 'FDR32': {'Item_Weight': 6.78},
 'FDM04': {'Item_Weight': 9.195},
 'FDH08': {'Item_Weight': 7.51},
 'FDZ08': {'Item_Weight': 12.5},
 'FDU03': {'Item_Weight': 18.7},
 'FDV08': {'Item_Weight': 7.35},
 'FDY49': {'Item_Weight': 17.2},
 'DRK47': {'Item_Weight': 7.905},
 'NCE06': {'Item_Weight': 5.825},
 'DRI47': {'Item_Weight': 14.7},
 'FDR35': {'Item_Weight': 12.5},
 'FDK03': {'Item_Weight': 12.6},
 'FDN48': {'Item_Weight': 13.35},
 'FDZ59': {'Item_Weight': 6.63},
 'FDL09': {'Item_Weight': 19.6},
 'FDL03': {'Item_Weight': 19.25},
 'NCG07': {'Item_Weight': 12.3},
 'FDP22': {'Item_Weight': 14.65},
 'FDL45': {'Item_Weight': 15.6},
 'FDC45': {'Item_Weight': 17.0},
 'FDI40': {'Item_Weight': 11.5},
 'FDQ11': {'Item_Weight': 5.695},
 'FDQ52': {'Item_Weight': 17.0},
 'FDJ27': {'Item_Weight': 17.7},
 'NCM18': {'Item_Weight': 13.0},
 'FDT26': {'Item_Weight': 18.85},
 'DRD60': {'Item_Weight': 15.7},
 'NCH07': {'Item_Weight': 13.15},
 'FDP44': {'Item_Weight': 16.5},
 'FDI48': {'Item_Weight': 11.85},
 'NCF06': {'Item_Weight': 6.235},
 'FDT24': {'Item_Weight': 12.35},
 'FDK08': {'Item_Weight': 9.195},
 'FDS11': {'Item_Weight': 7.05},
 'DRE15': {'Item_Weight': 13.35},
 'FDX21': {'Item_Weight': 7.05},
 'NCI42': {'Item_Weight': 18.75},
 'FDX37': {'Item_Weight': 16.2},
 'FDX14': {'Item_Weight': 13.1},
 'FDM09': {'Item_Weight': 11.15},
 'NCW54': {'Item_Weight': 7.5},
 'FDF47': {'Item_Weight': 20.85},
 'FDW12': {'Item_Weight': 8.315},
 'FDW24': {'Item_Weight': 6.8},
 'DRD01': {'Item_Weight': 12.1},
 'FDN25': {'Item_Weight': 7.895},
 'FDP20': {'Item_Weight': 19.85},
 'FDR45': {'Item_Weight': 10.8},
 'FDZ45': {'Item_Weight': 14.1},
 'FDB23': {'Item_Weight': 19.2},
 'FDC41': {'Item_Weight': 15.6},
 'NCM26': {'Item_Weight': 20.5},
 'FDW35': {'Item_Weight': 10.6},
 'FDK40': {'Item_Weight': 7.035},
 'NCL42': {'Item_Weight': 18.85},
 'FDC33': {'Item_Weight': 8.96},
 'FDY04': {'Item_Weight': 17.7},
 'NCG30': {'Item_Weight': 20.2},
 'NCH29': {'Item_Weight': 5.51},
 'FDV20': {'Item_Weight': 20.2},
 'NCM29': {'Item_Weight': 11.5},
 'FDD53': {'Item_Weight': 16.2},
 'FDI44': {'Item_Weight': 16.1},
 'FDU20': {'Item_Weight': 19.35},
 ...}

In [126]:
dict = {}
for key, value in d.items():
    dict[key] = value['Item_Weight']

In [127]:
dict

T38': 18.7,
 'FDO40': 17.1,
 'FDP12': 9.8,
 'FDG16': 15.25,
 'FDY11': 6.71,
 'FDL38': 13.8,
 'FDY60': 10.5,
 'FDW40': 14.0,
 'FDY08': 9.395,
 'NCM42': 6.13,
 'NCD07': 9.1,
 'FDD09': 13.5,
 'DRH59': 10.8,
 'DRN36': 15.2,
 'DRA24': 19.35,
 'FDG34': 11.5,
 'FDK22': 9.8,
 'FDO33': 14.75,
 'FDS10': 19.2,
 'FDU34': 18.25,
 'FDA26': 7.855,
 'FDP38': 10.1,
 'FDA50': 16.25,
 'FDY10': 17.6,
 'FDT19': 7.59,
 'NCV54': 11.1,
 'FDA28': 16.1,
 'FDB05': 5.155,
 'FDY52': 6.365,
 'FDR48': 11.65,
 'FDY15': 18.25,
 'FDM51': 11.8,
 'FDW09': 13.65,
 'FDV44': 8.365,
 'FDZ47': 20.7,
 'NCP43': 17.75,
 'FDL26': 18.0,
 'DRM35': 9.695,
 'DRD15': 10.6,
 'FDV04': 7.825,
 'NCN05': 8.235,
 'FDJ02': 17.2,
 'NCK17': 11.0,
 'FDO58': 19.6,
 'FDG33': 5.365,
 'NCZ05': 8.485,
 'NCP54': 15.35,
 'FDV01': 19.2,
 'FDF57': 14.5,
 'FDA02': 14.0,
 'DRJ37': 10.8,
 'NCP55': 14.65,
 'FDK38': 6.65,
 'NCZ30': 6.59,
 'DRY23': 9.395,
 'NCG19': 20.25,
 'FDQ01': 19.7,
 'FDL44': 18.25,
 'DRM23': 16.6,
 'NCE18': 10.0,
 'DRZ24': 7.535,
 'FDT48': 4.92,
 'DRG11': 6.385,
 'FDP60': 17.35,
 'FDE05': 10.895,
 'FDC32': 18.35,
 'FDJ22': 18.75,
 'NCH18': 9.3,
 'DRC13': 8.26,
 'FDG47': 12.8,
 'NCT05': 10.895,
 'FDN50': 16.85,
 'FDU60': 20.0,
 'FDX02': 16.0,
 'DRF27': 8.93,
 'FDQ59': 9.8,
 'NCZ53': 9.6,
 'FDD34': 7.945,
 'FDY43': 14.85,
 'FDG46': 8.63,
 'FDN44': 13.15,
 'FDD32': 17.7,
 'FDA56': 9.21,
 'FDT13': 14.85,
 'NCY29': 13.65,
 'NCA42': 6.965,
 'FDG26': 18.85,
 'FDH24': 20.7,
 'FDT52': 9.695,
 'FDT04': 17.25,
 'NCL54': 12.6,
 'FDW50': 13.1,
 'FDQ32': 17.85,
 'FDE29': 8.905,
 'FDB37': 20.25,
 'FDN46': 7.21,
 'FDV28': 16.1,
 'FDV40': 17.35,
 'FDZ57': 10.0,
 'FDY46': 18.6,
 'FDX45': 16.75,
 'FDB33': 17.75,
 'FDT58': 9.0,
 'NCL31': 7.39,
 'FDJ44': 12.3,
 'FDS50': 17.0,
 'FDA49': 19.7,
 'FDO50': 16.25,
 'DRK13': 11.8,
 'FDI20': 19.1,
 'FDM36': 11.65,
 'FDN12': 15.6,
 'FDG17': 6.865,
 'FDM32': 20.5,
 'FDC51': 10.895,
 'FDF16': 7.3,
 'FDI46': 9.5,
 'FDZ21': 17.6,
 'DRF25': 9.0,
 'FDH05': 14.35,
 'FDD52': 18.25,
 'FDR55': 12.15,
 'FDP04': 15.35,
 'FDQ14': 9.27,
 'DRN59': 15.0,
 'NCR06': 12.5,
 'FDB58': 10.5,
 'NCV41': 14.35,
 'FDW19': 12.35,
 'FDO56': 10.195,
 'FDN10': 11.5,
 'FDY20': 12.5,
 'FDV34': 10.695,
 'NCX18': 14.15,
 'FDT12': 6.215,
 'FDD57': 18.1,
 'FDK45': 11.65,
 'FDZ48': 17.75,
 'FDZ31': 15.35,
 'FDL21': 15.85,
 'FDC39': 7.405,
 'FDP45': 15.7,
 'FDC56': 7.72,
 'FDE59': 12.15,
 'FDB04': 11.35,
 'NCK05': 20.1,
 'FDR03': 15.7,
 'FDC59': 16.7,
 'DRB13': 6.115,
 'NCE54': 20.7,
 'FDC10': 9.8,
 'NCL29': 9.695,
 'FDM57': 11.65,
 'FDZ36': 6.035,
 'FDX10': 6.385,
 'FDO46': 9.6,
 'FDD16': 20.5,
 'FDY44': 14.15,
 'DRH51': 17.6,
 'FDI50': 8.42,
 'FDB60': 9.3,
 'FDA20': 6.78,
 'DRF37': 17.25,
 'FDJ26': 15.3,
 'FDZ25': 15.7,
 'FDZ58': 17.85,
 'NCG18': 15.3,
 'FDH50': 15.0,
 'DRO35': 13.85,
 'FDP52': 18.7,
 'FDC05': 13.1,
 'NCA41': 16.75,
 'FDX56': 17.1,
 'NCP02': 7.105,
 'FDZ49': 11.0,
 'NCJ17': 7.68,
 'FDP48': 7.52,
 'FDI53': 8.895,
 'FDW02': 4.805,
 'FDO48': 15.0,
 'NCR53': 12.15,
 'FDF56': 16.7,
 'FDL57': 15.1,
 'FDV52': 20.7,
 'NCS41': 12.85,
 'FDF12': 8.235,
 'FDM13': 6.425,
 'NCS42': 8.6,
 'FDD47': 7.6,
 'DRE03': 19.6,
 'FDE20': 11.35,
 'FDI33': 16.5,
 'NCT06': 17.1,
 'FDD10': 20.6,
 'FDK52': 18.25,
 'FDJ36': 14.5,
 'NCK18': 9.6,
 'FDB08': 6.055,
 'FDX43': 5.655,
 'FDU58': 6.61,
 'NCT29': 12.6,
 'NCB43': 20.2,
 'FDR37': 16.5,
 'FDG56': 13.3,
 'FDL13': 13.85,
 'FDQ03': 15.0,
 'NCC55': 10.695,
 'FDA25': 16.5,
 'FDV33': 9.6,
 'FDX47': 6.55,
 'FDB02': 9.695,
 'FDI56': 7.325,
 'FDQ08': 15.7,
 'DRJ49': 6.865,
 'FDP26': 7.785,
 'FDO32': 6.36,
 'FDR34': 17.0,
 'FDU59': 5.78,
 'FDN31': 11.5,
 'FDC03': 8.575,
 'FDL14': 8.115,
 'FDP39': 12.65,
 'FDT11': 5.94,
 'FDU48': 18.85,
 'NCP06': 20.7,
 'FDT45': 15.85,
 'FDE56': 17.25,
 'FDZ34': 6.695,
 'NCM54': 17.7,
 'FDV24': 5.635,
 'FDD46': 6.035,
 'FDQ39': 14.8,
 'FDE11': 17.7,
 'NCU54': 8.88,
 'FDO60': 20.0,
 'NCS06': 7.935,
 'FDQ55': 13.65,
 'NCO02': 11.15,
 'FDB12': 11.15,
 'FDT40': 5.985,
 'NCO05': 7.27,
 'FDR32': 6.78,
 'FDM04': 9.195,
 'FDH08': 7.51,
 'FDZ08': 12.5,
 'FDU03': 18.7,
 'FDV08': 7.35,
 'FDY49': 17.2,
 'DRK47': 7.905,
 'NCE06': 5.825,
 'DRI47': 14.7,
 'FDR35': 12.5,
 'FDK03': 12.6,
 'FDN48': 13.35,
 'FDZ59': 6.63,
 'FDL09': 19.6,
 'FDL03': 19.25,
 'NCG07': 12.3,
 'FDP22': 14.65,
 'FDL45': 15.6,
 'FDC45': 17.0,
 'FDI40': 11.5,
 'FDQ11': 5.695,
 'FDQ52': 17.0,
 'FDJ27': 17.7,
 'NCM18': 13.0,
 'FDT26': 18.85,
 'DRD60': 15.7,
 'NCH07': 13.15,
 'FDP44': 16.5,
 'FDI48': 11.85,
 'NCF06': 6.235,
 'FDT24': 12.35,
 'FDK08': 9.195,
 'FDS11': 7.05,
 'DRE15': 13.35,
 'FDX21': 7.05,
 'NCI42': 18.75,
 'FDX37': 16.2,
 'FDX14': 13.1,
 'FDM09': 11.15,
 'NCW54': 7.5,
 'FDF47': 20.85,
 'FDW12': 8.315,
 'FDW24': 6.8,
 'DRD01': 12.1,
 'FDN25': 7.895,
 'FDP20': 19.85,
 'FDR45': 10.8,
 'FDZ45': 14.1,
 'FDB23': 19.2,
 'FDC41': 15.6,
 'NCM26': 20.5,
 'FDW35': 10.6,
 'FDK40': 7.035,
 'NCL42': 18.85,
 'FDC33': 8.96,
 'FDY04': 17.7,
 'NCG30': 20.2,
 'NCH29': 5.51,
 'FDV20': 20.2,
 'NCM29': 11.5,
 'FDD53': 16.2,
 'FDI44': 16.1,
 'FDU20': 19.35,
 ...}

In [128]:
df.Item_Weight = df.Item_Weight.fillna(df.Item_Identifier.map(dict))
df

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.300,LF,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.920,REG,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.500,LF,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.200,REG,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,Small,Tier 3,Grocery Store,732.3800
4,NCD19,8.930,LF,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052
...,...,...,...,...,...,...,...,...,...,...,...,...
8518,FDF22,6.865,LF,0.056783,Snack Foods,214.5218,OUT013,1987,High,Tier 3,Supermarket Type1,2778.3834
8519,FDS36,8.380,REG,0.046982,Baking Goods,108.1570,OUT045,2002,Small,Tier 2,Supermarket Type1,549.2850
8520,NCJ29,10.600,LF,0.035186,Health and Hygiene,85.1224,OUT035,2004,Small,Tier 2,Supermarket Type1,1193.1136
8521,FDN46,7.210,REG,0.145221,Snack Foods,103.1332,OUT018,2009,Medium,Tier 3,Supermarket Type2,1845.5976
8522,DRG01,14.800,LF,0.044878,Soft Drinks,75.4670,OUT046,1997,Small,Tier 1,Supermarket Type1,765.6700

In [129]:
df['Item_Weight'].isna().any()

True

In [130]:
df[df['Item_Weight'].isna()]

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
927,FDN52,NaN,REG,0.130933,Frozen Foods,86.9198,OUT027,1985,Medium,Tier 3,Supermarket Type3,1569.9564
1922,FDK57,NaN,LF,0.079904,Snack Foods,120.0440,OUT027,1985,Medium,Tier 3,Supermarket Type3,4434.2280
4187,FDE52,NaN,REG,0.029742,Dairy,88.9514,OUT027,1985,Medium,Tier 3,Supermarket Type3,3453.5046
5022,FDQ60,NaN,REG,0.191501,Baking Goods,121.2098,OUT019,1985,Small,Tier 1,Grocery Store,120.5098

In [131]:
assign = {'FDN52':11.8, 'FDK57':13.5, 'FDE52':15.6, 'FDQ60':7.85, 'FDA15':9.3}

In [132]:
dict.update({'FDN52':11.8, 'FDK57':13.5, 'FDE52':15.6, 'FDQ60':7.85, 'FDA15':9.3})
dict

T38': 18.7,
 'FDO40': 17.1,
 'FDP12': 9.8,
 'FDG16': 15.25,
 'FDY11': 6.71,
 'FDL38': 13.8,
 'FDY60': 10.5,
 'FDW40': 14.0,
 'FDY08': 9.395,
 'NCM42': 6.13,
 'NCD07': 9.1,
 'FDD09': 13.5,
 'DRH59': 10.8,
 'DRN36': 15.2,
 'DRA24': 19.35,
 'FDG34': 11.5,
 'FDK22': 9.8,
 'FDO33': 14.75,
 'FDS10': 19.2,
 'FDU34': 18.25,
 'FDA26': 7.855,
 'FDP38': 10.1,
 'FDA50': 16.25,
 'FDY10': 17.6,
 'FDT19': 7.59,
 'NCV54': 11.1,
 'FDA28': 16.1,
 'FDB05': 5.155,
 'FDY52': 6.365,
 'FDR48': 11.65,
 'FDY15': 18.25,
 'FDM51': 11.8,
 'FDW09': 13.65,
 'FDV44': 8.365,
 'FDZ47': 20.7,
 'NCP43': 17.75,
 'FDL26': 18.0,
 'DRM35': 9.695,
 'DRD15': 10.6,
 'FDV04': 7.825,
 'NCN05': 8.235,
 'FDJ02': 17.2,
 'NCK17': 11.0,
 'FDO58': 19.6,
 'FDG33': 5.365,
 'NCZ05': 8.485,
 'NCP54': 15.35,
 'FDV01': 19.2,
 'FDF57': 14.5,
 'FDA02': 14.0,
 'DRJ37': 10.8,
 'NCP55': 14.65,
 'FDK38': 6.65,
 'NCZ30': 6.59,
 'DRY23': 9.395,
 'NCG19': 20.25,
 'FDQ01': 19.7,
 'FDL44': 18.25,
 'DRM23': 16.6,
 'NCE18': 10.0,
 'DRZ24': 7.535,
 'FDT48': 4.92,
 'DRG11': 6.385,
 'FDP60': 17.35,
 'FDE05': 10.895,
 'FDC32': 18.35,
 'FDJ22': 18.75,
 'NCH18': 9.3,
 'DRC13': 8.26,
 'FDG47': 12.8,
 'NCT05': 10.895,
 'FDN50': 16.85,
 'FDU60': 20.0,
 'FDX02': 16.0,
 'DRF27': 8.93,
 'FDQ59': 9.8,
 'NCZ53': 9.6,
 'FDD34': 7.945,
 'FDY43': 14.85,
 'FDG46': 8.63,
 'FDN44': 13.15,
 'FDD32': 17.7,
 'FDA56': 9.21,
 'FDT13': 14.85,
 'NCY29': 13.65,
 'NCA42': 6.965,
 'FDG26': 18.85,
 'FDH24': 20.7,
 'FDT52': 9.695,
 'FDT04': 17.25,
 'NCL54': 12.6,
 'FDW50': 13.1,
 'FDQ32': 17.85,
 'FDE29': 8.905,
 'FDB37': 20.25,
 'FDN46': 7.21,
 'FDV28': 16.1,
 'FDV40': 17.35,
 'FDZ57': 10.0,
 'FDY46': 18.6,
 'FDX45': 16.75,
 'FDB33': 17.75,
 'FDT58': 9.0,
 'NCL31': 7.39,
 'FDJ44': 12.3,
 'FDS50': 17.0,
 'FDA49': 19.7,
 'FDO50': 16.25,
 'DRK13': 11.8,
 'FDI20': 19.1,
 'FDM36': 11.65,
 'FDN12': 15.6,
 'FDG17': 6.865,
 'FDM32': 20.5,
 'FDC51': 10.895,
 'FDF16': 7.3,
 'FDI46': 9.5,
 'FDZ21': 17.6,
 'DRF25': 9.0,
 'FDH05': 14.35,
 'FDD52': 18.25,
 'FDR55': 12.15,
 'FDP04': 15.35,
 'FDQ14': 9.27,
 'DRN59': 15.0,
 'NCR06': 12.5,
 'FDB58': 10.5,
 'NCV41': 14.35,
 'FDW19': 12.35,
 'FDO56': 10.195,
 'FDN10': 11.5,
 'FDY20': 12.5,
 'FDV34': 10.695,
 'NCX18': 14.15,
 'FDT12': 6.215,
 'FDD57': 18.1,
 'FDK45': 11.65,
 'FDZ48': 17.75,
 'FDZ31': 15.35,
 'FDL21': 15.85,
 'FDC39': 7.405,
 'FDP45': 15.7,
 'FDC56': 7.72,
 'FDE59': 12.15,
 'FDB04': 11.35,
 'NCK05': 20.1,
 'FDR03': 15.7,
 'FDC59': 16.7,
 'DRB13': 6.115,
 'NCE54': 20.7,
 'FDC10': 9.8,
 'NCL29': 9.695,
 'FDM57': 11.65,
 'FDZ36': 6.035,
 'FDX10': 6.385,
 'FDO46': 9.6,
 'FDD16': 20.5,
 'FDY44': 14.15,
 'DRH51': 17.6,
 'FDI50': 8.42,
 'FDB60': 9.3,
 'FDA20': 6.78,
 'DRF37': 17.25,
 'FDJ26': 15.3,
 'FDZ25': 15.7,
 'FDZ58': 17.85,
 'NCG18': 15.3,
 'FDH50': 15.0,
 'DRO35': 13.85,
 'FDP52': 18.7,
 'FDC05': 13.1,
 'NCA41': 16.75,
 'FDX56': 17.1,
 'NCP02': 7.105,
 'FDZ49': 11.0,
 'NCJ17': 7.68,
 'FDP48': 7.52,
 'FDI53': 8.895,
 'FDW02': 4.805,
 'FDO48': 15.0,
 'NCR53': 12.15,
 'FDF56': 16.7,
 'FDL57': 15.1,
 'FDV52': 20.7,
 'NCS41': 12.85,
 'FDF12': 8.235,
 'FDM13': 6.425,
 'NCS42': 8.6,
 'FDD47': 7.6,
 'DRE03': 19.6,
 'FDE20': 11.35,
 'FDI33': 16.5,
 'NCT06': 17.1,
 'FDD10': 20.6,
 'FDK52': 18.25,
 'FDJ36': 14.5,
 'NCK18': 9.6,
 'FDB08': 6.055,
 'FDX43': 5.655,
 'FDU58': 6.61,
 'NCT29': 12.6,
 'NCB43': 20.2,
 'FDR37': 16.5,
 'FDG56': 13.3,
 'FDL13': 13.85,
 'FDQ03': 15.0,
 'NCC55': 10.695,
 'FDA25': 16.5,
 'FDV33': 9.6,
 'FDX47': 6.55,
 'FDB02': 9.695,
 'FDI56': 7.325,
 'FDQ08': 15.7,
 'DRJ49': 6.865,
 'FDP26': 7.785,
 'FDO32': 6.36,
 'FDR34': 17.0,
 'FDU59': 5.78,
 'FDN31': 11.5,
 'FDC03': 8.575,
 'FDL14': 8.115,
 'FDP39': 12.65,
 'FDT11': 5.94,
 'FDU48': 18.85,
 'NCP06': 20.7,
 'FDT45': 15.85,
 'FDE56': 17.25,
 'FDZ34': 6.695,
 'NCM54': 17.7,
 'FDV24': 5.635,
 'FDD46': 6.035,
 'FDQ39': 14.8,
 'FDE11': 17.7,
 'NCU54': 8.88,
 'FDO60': 20.0,
 'NCS06': 7.935,
 'FDQ55': 13.65,
 'NCO02': 11.15,
 'FDB12': 11.15,
 'FDT40': 5.985,
 'NCO05': 7.27,
 'FDR32': 6.78,
 'FDM04': 9.195,
 'FDH08': 7.51,
 'FDZ08': 12.5,
 'FDU03': 18.7,
 'FDV08': 7.35,
 'FDY49': 17.2,
 'DRK47': 7.905,
 'NCE06': 5.825,
 'DRI47': 14.7,
 'FDR35': 12.5,
 'FDK03': 12.6,
 'FDN48': 13.35,
 'FDZ59': 6.63,
 'FDL09': 19.6,
 'FDL03': 19.25,
 'NCG07': 12.3,
 'FDP22': 14.65,
 'FDL45': 15.6,
 'FDC45': 17.0,
 'FDI40': 11.5,
 'FDQ11': 5.695,
 'FDQ52': 17.0,
 'FDJ27': 17.7,
 'NCM18': 13.0,
 'FDT26': 18.85,
 'DRD60': 15.7,
 'NCH07': 13.15,
 'FDP44': 16.5,
 'FDI48': 11.85,
 'NCF06': 6.235,
 'FDT24': 12.35,
 'FDK08': 9.195,
 'FDS11': 7.05,
 'DRE15': 13.35,
 'FDX21': 7.05,
 'NCI42': 18.75,
 'FDX37': 16.2,
 'FDX14': 13.1,
 'FDM09': 11.15,
 'NCW54': 7.5,
 'FDF47': 20.85,
 'FDW12': 8.315,
 'FDW24': 6.8,
 'DRD01': 12.1,
 'FDN25': 7.895,
 'FDP20': 19.85,
 'FDR45': 10.8,
 'FDZ45': 14.1,
 'FDB23': 19.2,
 'FDC41': 15.6,
 'NCM26': 20.5,
 'FDW35': 10.6,
 'FDK40': 7.035,
 'NCL42': 18.85,
 'FDC33': 8.96,
 'FDY04': 17.7,
 'NCG30': 20.2,
 'NCH29': 5.51,
 'FDV20': 20.2,
 'NCM29': 11.5,
 'FDD53': 16.2,
 'FDI44': 16.1,
 'FDU20': 19.35,
 ...}

In [133]:
df.Item_Weight = df.Item_Weight.fillna(df.Item_Identifier.map(dict))

In [134]:
df['Item_Weight'].isna().any()

False

In [135]:
df.isna().any()

Item_Identifier              False
Item_Weight                  False
Item_Fat_Content             False
Item_Visibility              False
Item_Type                    False
Item_MRP                     False
Outlet_Identifier            False
Outlet_Establishment_Year    False
Outlet_Size                  False
Outlet_Location_Type         False
Outlet_Type                  False
Item_Outlet_Sales            False
dtype: bool

Done